if ($(панель = '.панель_сортировки_и_фильтра ').length == 1) {
  локальный_путь_к_файлу = 'блоки/каталог/'
  // Инициализация фильтра
    url = new URLSearchParams (window.location.search)
    if ((фильтр = url.get('фильтр')) != null)
      {
        фильтр = фильтр.split(';')
          флаги = фильтр[0].split(',')
            $('.панель_сортировки_и_фильтра .toggleText.tT0 > p:nth-child(1)').text(флаги[0])
            $('.панель_сортировки_и_фильтра .toggleText.tT1 > p:nth-child(1)').text(флаги[1])
          $(панель + '.чекбоксы *').addClass ('a')
          $(панель + '.чекбоксы:eq(0) *').each(function () {
            if (фильтр[2].includes($(this).text())) $(this).removeClass ('a')
          })
          фильтр[3].slice (1, -1).split (',').forEach((индекс) => {
            $(панель + '.чекбоксы:eq(1) *').eq (индекс).removeClass ('a')
          })
      }
  // Конец инициализации фильтра
  function установим_параметры_фильтра () {
    url = new URLSearchParams (window.location.search)
    панель = '.панель_сортировки_и_фильтра '
    бренд  = url.get('бренд')
    if (бренд == null) бренд1 = ''
    путь   = url.get('путь')
    флаги  = [$(панель + '.tT0 p').eq(0).text(), $(панель + '.tT1 p').eq(0).text()]
    бренды = []
    $(панель + '.чекбоксы:eq(0) *:not(.a)').each(function () {
      бренды.push ($(this).text())
    })
    inp0 = $(панель + '.keyup').eq(0)
    inp1 = $(панель + '.keyup').eq(1)
      if ((iv0 = inp0.val()) == '') {inp0v = inp0.attr('placeholder').substring(4)} else {inp0v = iv0}
      if ((iv1 = inp1.val()) == '') {inp1v = inp1.attr('placeholder').substring(4)} else {inp1v = iv1}
    вилка_цен = [inp0v, inp1v]
    if (бренд == null) {путь0 = 'путь=' + путь} else {путь0 = 'бренд=' + бренд}
    фильтр = флаги[0] + ',' + флаги[1] + ';' + вилка_цен[0] + ',' + вилка_цен[1] + ';' + бренды
    if ((сортировка = url.get('сортировка')) != null) {
      сортировка = '&сортировка=' + сортировка
    } else {
      сортировка = ''
    }
  }
  установим_параметры_фильтра ()
  function возьмем_категории_из_тегов_фильтра () {
    запрос_дерево = панель + '.чекбоксы_категорий *'
    дерево = []
    $(запрос_дерево + ':not(.a)').each (function () {
      дерево.push ($(this).attr ('путь').slice (0, -1))
    })
    // все_дерево = []
    // $(запрос_дерево).each (function () {
    //   все_дерево.push ($(this).attr ('путь').slice (0, -1))
    // })
    function удалим_корни (массив) {
      массив.forEach((item, i) => {
        if ((следующий = массив [i + 1]) != undefined) {
          if (item.split('/').length < следующий.split('/').length) {
            delete item
          }
        }
      })
    }
    удалим_корни (дерево)
    // удалим_корни (все_дерево)
    теги_чекбоксов = $(запрос_дерево)
  }
  возьмем_категории_из_тегов_фильтра ()
  щет (0, дерево)
  function щет (аякс = 0, дерево) {
    $.get(домен + локальный_путь_к_файлу + 'фильтр/щет.php', {
      путь:          путь,
      вилка_цен:     вилка_цен,
      бренды:        бренды,
      флаги:         флаги,
      бренд_из_юрл:  url.get('бренд'),
      дерево:        дерево,
    }, (D) => {
      d0 = D.split(',')
      $(панель + 'button:eq(0)').attr('class', 'дефолт').html('Показано <i>' + d0[0] + '</i> из <i>' + d0[1] + '</i>')
      x4 = Math.ceil((+$(панель + 'button:eq(0)').children().eq(0).text()) / 8)
      if (аякс == 1) {
        $.get(домен + локальный_путь_к_файлу + 'пагинация.php', {
          путь:               путь,
          страница:           1,
          количество_страниц: x4,
          бренд:              url.get('бренд'),
        }, (D) => {
          $('.Пагинация').html(D)
          $('.Пагинация a').each(function() {$(this).attr('href', $(this).attr('href') + '&фильтр=' + фильтр + сортировка)})
        })
      }
    })
  }
  $('body').on('click', панель + '.toggle,' + панель + '.чекбоксы *', function () {
    $(this).toggleClass('a')
  })
  $('body').on('keyup', панель + '.keyup', function (event) {
    event = event || window.event
    if (this.value.match(/[^0-9]/g)) {
      this.value = this.value.replace(/[^0-9]/g, '')
    }
    запрос_фильтра (0, 0)
  })
  $('body').on('click', панель + '.чекбоксы_брендов *', function () {
    запрос_фильтра (1, 0)
  })
  $('body').on('click', панель + '.toggleText span', function () {
    (q = $(this)).parent().prev().toggleClass('a').text(q.text())
    запрос_фильтра (2, 0)
  })
  $('body').on('click', панель + '.чекбоксы_категорий *', function () {
    условие = $(this).attr('путь')
    длинна_условия = условие.split('/').length
    if ($(this).hasClass('a')) {
      $(панель + '.чекбоксы_категорий *').each (function () {
        if ($(this).attr ('путь').includes (условие)) $(this).addClass ('a')
      })
      for (i = длинна_условия; i > 1; i--) {
        условие_для_строчки = условие.split('/').slice(1, i - 1).join('/') + '/'
        if (условие_для_строчки != '') {
          условие_для_строчки = условие.split('/')[0] + '/' + условие_для_строчки
          щет_категорий = 0
          $(панель + '.чекбоксы_категорий *').each (function (){
            if ($(this).attr ('путь').includes (условие_для_строчки)) {
              if (!$(this).hasClass ('a')) {
                щет_категорий++
              }
            }
          })
          if (щет_категорий == 1) $(панель + '.чекбоксы_категорий *[путь="' + условие_для_строчки + '"]').addClass ('a')
        }
      }
    }
    if (!$(this).hasClass('a')) {
      $(панель + '.чекбоксы_категорий *').each (function () {
        if ($(this).attr ('путь').includes (условие)) $(this).removeClass ('a')
      })
      for (i = 0; i < длинна_условия; i++) {
        $(панель + '.чекбоксы_категорий *[путь="' + условие.split ('/').slice(0, i) + '"]').removeClass ('a')
        $(панель + '.чекбоксы_категорий *').each (function () {
          item = $(this)
          if (item.attr ('путь') == условие.split ('/').slice(0, i).join ('/') + '/') {
            item.removeClass ('a')
          }
        })
      }
    }
    запрос_фильтра (3, 0)
  })
  function запрос_фильтра (индекс_фильтра, сброс) {
    установим_параметры_фильтра ()
    возьмем_категории_из_тегов_фильтра ()
    $.get (домен + локальный_путь_к_файлу + 'фильтр/динамика.php', {
      индекс_фильтра: индекс_фильтра,
      путь:           путь,
      бренды:         бренды,
      флаги:          флаги,
      дерево:         дерево,
      вилка_цен:      вилка_цен,
    }, (D) => {
      if (индекс_фильтра != 9) {
        d = D.split(';')
        if (индекс_фильтра != 0) {
          вилка_цен = d [0].split (',')
          inp0.val (вилка_цен [0])
          inp1.val (вилка_цен [1])
        }
        if (индекс_фильтра != 1) {
          бренды = ''
          $(панель + '.чекбоксы:eq(0) *').each(function () {
            if (d[1].includes((бренд = $(this).addClass('a')).text ())) {
              бренды += бренд.text() + ','
              бренд.removeClass('a')
            }
          })
        }
        if (индекс_фильтра != 2) {
          $('.панель_сортировки_и_фильтра .toggleText.tT0 > p:nth-child(1),.панель_сортировки_и_фильтра .toggleText.tT1 > p:nth-child(1)').text('Все')
        }
        if (индекс_фильтра != 3) {
          теги_чекбоксов.addClass ('a')
          e = 0
          if (индекс_фильтра == 1) e = 1
          if (индекс_фильтра == 2) e = 2
          d [e].split (',').forEach((условие) => {
            длинна_условия = условие.split('/').length
            for (i = длинна_условия; i > 1; i--) {
              условие_для_строчки = условие.split ('/').slice (0, i).join ('/')
              if (условие_для_строчки == '') continue
                условие_для_строчки = условие_для_строчки + '/'
                теги_чекбоксов.each (function (){
                  if ($(this).attr ('путь') == условие_для_строчки) $(this).removeClass ('a')
                })
            }
          })
        }
        // Сформируем цифровой массив категорий
          цифровое_дерево = []
          теги_чекбоксов.each (function () {
            if (!$(this).hasClass ('a')) цифровое_дерево.push ($(this).index())
          })
        параметры = '&фильтр=' + флаги[0] + ',' + флаги[1] + ';' + вилка_цен[0] + ',' + вилка_цен[1] + ';' + бренды + ';' + (цифровое_дерево = '[' + цифровое_дерево.toString () + ']') + сортировка
        // Если бренды или категории пустые прервем программу
          h = 0
          if (бренды == '') {
            $(панель + '.чекбоксы:eq(1) *').addClass ('a')
            h = 1
          }
          if (цифровое_дерево == '[]') {
            $(панель + '.чекбоксы:eq(0) *').addClass ('a')
            h = 1
          }
          if (h == 1) {
            $(панель + 'button:eq(0) *:eq(0)').text (0)
            $('.лента_каталога').html ('')
            параметры = ''
          }
        history.pushState ('object or string', 'Title', домен + 'каталог.php?' + путь0 + '&страница=1' + параметры)
        if (h == 1) {
          return false
        }
      }
      $.get (домен + локальный_путь_к_файлу + 'лента_каталога.php', {
        аякс:          1,
        страница:      1,
        фильтр:        фильтр,
        полное_дерево: дерево,
        сортировка:    сортировка,
        бренд:         бренд1,
        путь:          путь,
      }, (D) => {
        $('.лента_каталога').html (D)
        функция_ленты_каталога ()
        проверка_товаров_на_куки ()
        щет (аякс = 1, дерево)
        разряд ()
      })
    })
  }
  $('body').on('click', панель + 'button:eq(0)', function() {return false})
  $('body').on('click', панель + 'button:eq(1)', function() {
    $(панель + '> :nth-child(2) > span').html('')
    $(панель + '.keyup').eq(0).val('')
    $(панель + '.keyup').eq(1).val('')
    p0 = $(панель + '.tT0 *')
    p0.eq(0).text(p0.last().text())
    p1 = $(панель + '.tT1 *')
    p1.eq(0).text(p1.last().text())
    $(панель + '.чекбоксы:eq(0) *').each(function () {$(this).attr('class', '')})
    $(панель + 'button:eq(0)').children().eq(0).text($(панель + 'button:eq(0)').children().eq(1).text())
    $(".панель_сортировки_и_фильтра .toggleText").each(function() {
      $(this).children().eq(0).removeClass('a')
    })
    $(панель + '.чекбоксы_категорий *').each(function() {
      $(this).removeClass('a')
    })
    запрос_фильтра (9, 1)
    history.pushState ('object or string', 'Title', домен + 'каталог.php?' + путь0 + '&страница=1')
    return false
  })
}
