<?php
  $путь_домой = '../../../../';
  include $путь_домой . 'функции.php';
  рекурсия_каталога ($путь_домой . 'товары/', $один_из_типов_главной = '', $путь = $_GET['путь'], $бренд = '');
  $доступная_вилка_цен       = [];
  $доступные_бренды_на_вывод = [];
  $доступные_папки_на_вывод  = [];
  foreach (explode ('^__^', $каталог) as $позиция_каталога) {
    $ячейка = explode ('^_^', $позиция_каталога);
    $папка  = implode ('/', array_slice (explode ('/', $ячейка [0]), 5, -2));
      // Отфильтруем массив
        if ($_GET ['индекс_фильтра'] == 0) {
          if ($_GET ['вилка_цен'][0] > (int) $ячейка[4]) continue;
          if ($_GET ['вилка_цен'][1] < (int) $ячейка[4]) continue;
        }
        if ($_GET ['индекс_фильтра'] == 1) {
          if ($_GET ['бренды'] != '') if (!in_array ($ячейка [3], $_GET ['бренды'])) continue;
        }
        if ($_GET ['индекс_фильтра'] == 2) {
          if ($_GET ['флаги'] [0] == $микро_запросы_к_меткам_товара [0][0]) if (!str_contains ($ячейка [1], $микро_запросы_к_меткам_товара [1][0])) continue;
          if ($_GET ['флаги'] [0] == $микро_запросы_к_меткам_товара [0][1]) if ( str_contains ($ячейка [1], $микро_запросы_к_меткам_товара [1][0])) continue;
          if ($_GET ['флаги'] [1] == $микро_запросы_к_меткам_товара [0][0]) if (!str_contains ($ячейка [1], $микро_запросы_к_меткам_товара [1][1])) continue;
          if ($_GET ['флаги'] [1] == $микро_запросы_к_меткам_товара [0][1]) if ( str_contains ($ячейка [1], $микро_запросы_к_меткам_товара [1][1])) continue;
        }
        if ($_GET ['индекс_фильтра'] == 3) {
          if ($_GET ['дерево'] != '') if (!in_array ($папка, $_GET ['дерево'])) continue;
        }
    // Сформируем вывод
      if ($_GET ['индекс_фильтра'] != 0) {
        $доступная_вилка_цен       [] = $ячейка [4];
      }
      if ($_GET ['индекс_фильтра'] != 1) {
        $доступные_бренды_на_вывод [] = $ячейка [3];
      }
      if ($_GET ['индекс_фильтра'] != 3) {
        $доступные_папки_на_вывод  [] = $папка;
      }
  }
  if ($_GET ['индекс_фильтра'] != 0) {
    $доступная_вилка_цен = array_unique ($доступная_вилка_цен);
    echo min ($доступная_вилка_цен) . ',' . max ($доступная_вилка_цен);
    echo ';';
  }
  if ($_GET ['индекс_фильтра'] != 1) {
    echo implode (',', array_unique ($доступные_бренды_на_вывод));
    echo ';';
  }
  if ($_GET ['индекс_фильтра'] != 3) {
    echo implode (',', array_unique ($доступные_папки_на_вывод));
  }
?>
