<?php
  include '../../../../функции.php';
  $путь          = $_GET['e0'];
  $цены          = $_GET['e1'];
  $бренды        = $_GET['e2'];
  $новинка       = $_GET['e3'][0];
  $акция         = $_GET['e3'][1];
  $номер_фильтра = $_GET['e4'];
  рекурсия_каталога ('../../../../товары/', '', $путь, $бренд, '');
  $цены2    = [];
  $бренды2  = '';
  foreach (explode ('^__^', $каталог) as $v0) {
    if ($v0 == '') continue;
    $i1 = explode ('^_^', $v0);
      if ($номер_фильтра == 0) if (($цены[0] > $i1[4]) or ($цены[1] < $i1[4]))       continue;
      if ($номер_фильтра == 1) if ($бренды!= '') if (!str_contains ($бренды, $i1[3])) continue;
      if ($номер_фильтра == 2) {
        if ($новинка == 'Да')  if (!str_contains ($i1[1], 'Новинка')) continue;
        if ($новинка == 'Нет') if (str_contains  ($i1[1], 'Новинка')) continue;
        if ($акция   == 'Да')  if (!str_contains ($i1[1], 'Акция'))   continue;
        if ($акция   == 'Нет') if (str_contains  ($i1[1], 'Акция'))   continue;
      }
    $цены2   [] = $i1[4];
    $бренды2   .= $i1[3];
  }
  echo min (array_unique ($цены2)) . ',' . max (array_unique ($цены2)) . ';';
  echo $бренды2;
?>
