<?php
  include '../../../../функции.php';
  $путь          = $_GET['e0'];
  $цены          = $_GET['e1'];
  $бренды        = $_GET['e2'];
  $новинка       = $_GET['e3'][0];
  $акция         = $_GET['e3'][1];
  $номер_фильтра = $_GET['e4'];
  рекурсия_каталога ('../../../../товары/', $один_из_типов_главной = '', $путь, $бренд = '', $полное_дерево = '');
  $цены2    = [];
  $бренды2  = [];
  $массив_папок = [];
  $d = [];
  foreach (explode ('^__^', $каталог) as $v0) {
    if ($v0 == '') continue;
    $i1 = explode ('^_^', $v0);
      if ($номер_фильтра == 0) if (($цены[0] > $i1[4]) or ($цены[1] < $i1[4])) continue;
      if ($номер_фильтра == 1) {
        foreach (explode (',', $бренды) as $бренд) {
          if ($бренд == $i1[3]) $бренды2 [] = $i1[3] . ',';
        }
      }
      if ($номер_фильтра == 2) {
        if ($новинка == 'Да')  if (!str_contains ($i1[1], 'Новинка')) continue;
        if ($новинка == 'Нет') if (str_contains  ($i1[1], 'Новинка')) continue;
        if ($акция   == 'Да')  if (!str_contains ($i1[1], 'Акция'))   continue;
        if ($акция   == 'Нет') if (str_contains  ($i1[1], 'Акция'))   continue;
      }
      if ($номер_фильтра == 3) {
        // Если элемент рекурсии есть в полном дереве
          if (($полное_дерево = $_GET ['полное_дерево']) != '') {
            $папка = implode ('/', $папка = array_slice (explode ('/', $i1[0]), 5, -2));
            if (!in_array ($папка, $полное_дерево)) {
              continue;
            }
          }
      }
      if ($номер_фильтра != 3) {
        foreach (explode (',', $бренды) as $бренд) {
          if ($бренд == $i1[3]) {
            $папка = implode ('/', $папка = array_slice (explode ('/', $i1[0]), 5, -2));
            $массив_папок [] = $папка . '/,';
          }
        }
      }
    $цены2   [] = $i1[4];
    $бренды2 [] = $i1[3] . ',';
    $d [] = $v0 . '^__^';
  }
  echo min (array_unique ($цены2)) . ',' . max (array_unique ($цены2));
  echo ';;';
  echo substr (str_replace (',/', ',', implode ('/', (array_unique ($бренды2)))), 0, -1);
  echo ';;';
  echo substr (str_replace (',/', ',', implode ('/', (array_unique ($массив_папок)))), 0, -1);
  echo ';;';
  print_r ($d);
?>
