<?php
  include '../../../../функции.php';
  $путь    = $_GET['e0'];
  $цены    = $_GET['e1'];
  $бренды  = $_GET['e2'];
  $новинка = $_GET['e3'][0];
  $акция   = $_GET['e3'][1];
  $бренд   = $_GET['5'];
  рекурсия_каталога ('../../../../товары/', '', $путь, $бренд, '');
  $щет0 = 0;
  $щет1 = 0;
  foreach (explode ('^__^', $каталог) as $v0) {
    $щет1++;
    $i1 = explode ('^_^', $v0);
      if (($цены[0] > ($i2 = $i1[4])) or ($цены[1] < $i2))          continue;
      if (!str_contains ($бренды, $i1[3]))                          continue;
      if ($новинка == 'Да')  if (!str_contains ($i1[1], 'Новинка')) continue;
      if ($новинка == 'Нет') if (str_contains  ($i1[1], 'Новинка')) continue;
      if ($акция   == 'Да')  if (!str_contains ($i1[1], 'Акция'))   continue;
      if ($акция   == 'Нет') if (str_contains  ($i1[1], 'Акция'))   continue;
    $щет0++;
  }
  echo $щет0 . ',' . $щет1 - 1;
?>
