выезджающее_меню = $(
  '<div class="выезджающее_меню">' +
    '<svg><use xlink:href="#icon_shop_close_small"><symbol viewBox="0 0 20 20" id="icon_shop_close_small" xmlns="http://www.w3.org/2000/svg"><path d="M5.279 4.218a.75.75 0 10-1.061 1.06L8.939 10l-4.72 4.72a.75.75 0 001.06 1.062L10 11.06l4.722 4.72a.75.75 0 001.06-1.06L11.061 10l4.72-4.722a.75.75 0 10-1.06-1.06L10 8.938 5.279 4.22z"></path></symbol></use></svg>' +
    '<div class="контекстное_меню">' +
      '<p>Назад</p>' +
      '<a class="титул" href=""></a>' +
      '<div class="суб_меню"></div>' +
    '</div>' +
    '<p><a class="актив">Меню</a><a>Каталог</a></p>' +
  '</div>'
)
верхнее_меню = $('header .блок_1 ul')
каталог_меню = $('header .блок_3 .меню')
кнопка_заказать_звонок = $('header .кнопка_обратный_звонок')
тень_для_меню = $('<p class="тень_для_меню"></p>')
кнопки_адаптив = $(
  '<p class="кнопки_адаптив">' +
    '<svg><use xlink:href="' + домен + '/стили/svg/sprite3.svg#icon_site_catalog"></use></svg>' +
    '<svg><use xlink:href="' + домен + '/стили/svg/sprite3.svg#icon_site_burger"></use></svg>' +
    '<svg><use xlink:href="' + домен + '/стили/svg/sprite3.svg#icon_shop_search"></use></svg>' +
    '<svg><use xlink:href="' + домен + '/стили/svg/sprite3.svg#icon_site_phone"></use></svg>' +
  '</p>'
)
function рисайз_окна () {
  q = $('header')
  if ($(window).width() < 1200) {
    q.prepend(выезджающее_меню)
    q.prepend(тень_для_меню)
    выезджающее_меню.append(верхнее_меню.css('display', 'block')).append(каталог_меню)
    q.find('.блок_1 > *').prepend(кнопки_адаптив)
    $('.блок_3 .кнопка').hide()
    $('.окно_1 table').after(кнопка_заказать_звонок)
    кнопка_заказать_звонок.html('Обратный звонок <svg><use xlink:href="#icon_site_recall"><symbol id="icon_site_recall" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M5.087 19.715c.146-.15.368-.349.629-.569a25.009 25.009 0 012.2-1.662c.153-.1.302-.19.435-.263.114-.061.284-.147.46-.184.913-.19 1.634.286 2.032.514.464.266.645.321.872.242 2.46-1.008 4.177-2.724 5.186-5.183.079-.227.023-.409-.243-.873l-.052-.09c-.24-.411-.639-1.094-.462-1.942a1.77 1.77 0 01.183-.46c.072-.133.164-.282.264-.435.2-.308.46-.67.729-1.027.53-.704 1.151-1.459 1.5-1.8.388-.381.878-.682 1.43-.729.486-.041.981.134 1.406.355.409.213.8.499 1.141.788.65.55 1.215 1.196 1.443 1.559.891 1.24.74 2.773.031 4.338-.934 2.279-3.102 5.048-5.507 7.437-2.406 2.39-5.163 4.513-7.359 5.43-1.591.737-3.106.84-4.337-.023-.168-.104-.4-.29-.632-.496a9.89 9.89 0 01-.875-.887 6.519 6.519 0 01-.82-1.158c-.22-.41-.406-.907-.383-1.424.025-.56.348-1.068.73-1.458zM22.974 8.761c-.102-.169-.553-.716-1.147-1.22a4.878 4.878 0 00-.864-.602c-.276-.143-.475-.19-.6-.189-.187.025-.339.164-.475.288l-.038.036c-.27.27-.82.932-1.332 1.611-.258.343-.495.675-.67.944a4.934 4.934 0 00-.2.33 1.247 1.247 0 00-.04.08c-.041.242.061.446.351.952l.003.005c.26.452.686 1.196.345 2.137a.697.697 0 01-.01.029c-1.163 2.845-3.184 4.865-6.03 6.027a.534.534 0 01-.028.01c-.94.342-1.685-.085-2.137-.344l-.004-.002c-.506-.29-.71-.393-.953-.353a1.285 1.285 0 00-.08.04 4.929 4.929 0 00-.33.201c-.27.175-.601.412-.944.67-.698.526-1.374 1.09-1.63 1.352-.205.21-.29.376-.305.49 0 .14.056.352.208.636.154.288.378.592.63.884.251.289.516.55.74.749.154.137.314.258.481.377.623.446 1.52.524 2.872-.104l.012-.005a.551.551 0 01.016-.007c1.932-.804 4.532-2.773 6.892-5.116 2.36-2.345 4.363-4.95 5.181-6.954l.003-.007.009-.02c.62-1.363.56-2.258.111-2.869a.775.775 0 01-.037-.056z"></path><path d="M11.958 5.505a.75.75 0 11.166 1.49 7.22 7.22 0 00-6.379 6.371.75.75 0 11-1.49-.168 8.72 8.72 0 017.703-7.693z"></path><path d="M12.777 9.65a.75.75 0 00-.88-.593 5.176 5.176 0 00-4.09 4.09.75.75 0 101.472.288 3.676 3.676 0 012.905-2.906.75.75 0 00.593-.88z"></path></symbol></use></svg>')
    q.find('.кнопки_адаптив svg').eq(0)
  }
  if ($(window).width() > 1200) {
    q.find(выезджающее_меню).remove()
    $('header .кнопки_адаптив').remove()
    $('header .блок_1 > *').prepend(верхнее_меню.css('display', 'flex'))
    $('header .блок_3 > *').prepend(каталог_меню)
    $('.блок_3 .кнопка').show()
    $('.блок_2').append(кнопка_заказать_звонок)
    кнопка_заказать_звонок.html('Обратный звонок')
  }
}
рисайз_окна ()
$(window).resize(() => {рисайз_окна ()})
$('.выезджающее_меню > p a').on('click', function() {
    $('.выезджающее_меню > p a').removeClass('актив')
    q = $(this)
    q.addClass('актив')
    w = $('.выезджающее_меню > ul')
    w.css('display', 'none')
    w.eq(q.index()).css('display', 'block')
})
$('body').on('click', 'header .выезджающее_меню .d', function() {
    q = $('header .выезджающее_меню .контекстное_меню')
    q.css('overflow', 'visible').animate({width: '100%'})
    q.find('.суб_меню').html($(this).next().html())
    q.find('.титул').html($(this).html()).attr('href', $(this).attr('href'))
    return false
})
$('body').on('click', 'header .контекстное_меню p', function() {$('header .выезджающее_меню .контекстное_меню').css('overflow', 'hidden').animate({width: 0})})
$('body').on('click', 'header .блок_1 svg:eq(0),header .блок_1 svg:eq(1)', function() {
    w = $('.тень_для_меню')
    q = $('header .выезджающее_меню')
    q.animate({left: 0})
    w.css('display', 'flex').animate({opacity: .3})
    q.find('a').each(function() {if ($(this).next('p').length > 0) {$(this).addClass('d')}})
})
$('body').on('click', 'header .выезджающее_меню > svg,.тень_для_меню', function() {
    $('header .выезджающее_меню').animate({left: '-100%'})
    $('.тень_для_меню').animate({opacity: 0}, () => {$('.тень_для_меню').hide()})
})
$('body').on('click', '.кнопка_показать_окно', function() {
    if ($(this).hasClass('показать_окно_4')) if ($(this).next().text() == 0) return
    i = '.' + $(this).attr('href')
    $(i).css('display', 'flex')
    $(i + ' .тень').animate({opacity: .3})
    $(i + ' > div').animate({opacity: 1})
    return false
})
xx = $('<li class="каталог_в_закрепленное_меню_при_скролле"><a><b>Каталог</b></a></li>').append($('header .блок_3 .меню').clone())
$(document).on("scroll", window, () => {
    if ($(window).scrollTop() > $('header .блок_3').offset().top + 20) {$('header .блок_1 > * > ul').prepend(xx)} else {xx.remove()}
})
$('body').on('click', '.окно .тень', function() {
    i = '.' + $(this).attr('href')
    $(i + ' .тень').animate({opacity: 0}, () => {$(i).hide()})
    $(i + ' > div').animate({opacity: 0})
    $('.' + z).removeClass(z)
})
$('body').on('click', '.каталог_в_закрепленное_меню_при_скролле > a', function(){$(this).toggleClass('a').next().toggleClass('a')})
if ($('.slider').length > 0) {
  new SimpleAdaptiveSlider('.slider', {
    autoplay: false,
    interval: 5000,
    swipe: true
  })
}
